function selectGpu() {
    
    let choice = prompt("Яку відеокарту ви хочете вибрати? Виберіть:\n1. Бюджетна відеокарта\n2. Середня відеокарта\n3. Топова відеокарта");


    if (choice === "1") {
        alert("Ви вибрали бюджетну відеокарту:\nОб’єм пам’яті: 4GB GDDR6\nРозрядність шини: 128-bit\nЕнергоспоживання: 75W");
    } else if (choice === "2") {
        alert("Ви вибрали середню відеокарту:\nОб’єм пам’яті: 12GB GDDR6\nРозрядність шини: 192-bit\nЕнергоспоживання: 170W");
    } else if (choice === "3") {
        alert("Ви вибрали топову відеокарту:\nОб’єм пам’яті: 24GB GDDR6X\nРозрядність шини: 384-bit\nЕнергоспоживання: 450W");
    } else {
        alert("Невірний вибір. Будь ласка, виберіть 1, 2 або 3.");
    }

    let attempts = 0;
    while (choice !== "1" && choice !== "2" && choice !== "3" && attempts < 2) {
        choice = prompt("Невірний вибір! Виберіть:\n1. Бюджетна відеокарта\n2. Середня відеокарта\n3. Топова відеокарта");
        attempts++;
    }

    if (attempts === 2 && (choice !== "1" && choice !== "2" && choice !== "3")) {
        alert("Спробуйте ще раз пізніше!");
    }
}

selectGpu();
